README.md modifications
